RhinoInside.Revit API Documentation
GeometryEncoder.ToCurveLoop Method
 Converts the specified Curve to an equivalent Revit CurveLoop.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8021
Syntax
public static Autodesk.Revit.DB.CurveLoop ToCurveLoop(
	this Rhino.Geometry.Curve value
)
@staticmethod
def ToCurveLoop(
	value: Rhino.Geometry.Curve
) -> Autodesk.Revit.DB.CurveLoop
Parameters
value
Type: Rhino.Geometry.Curve
A value to convert.
Return Value
Type: Autodesk.Revit.DB.CurveLoop
A Revit CurveLoop that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Curve. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace